tutorials/case_channel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;//PBiCGStab;
        smoother        FDIC;
        preconditioner  FDIC;
        tolerance       1e-10;
        relTol          1e-2;
        //maxIter         20;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        //type            coupled;
        solver          PBiCGStab;
        //solver          PBiCCCG;
        preconditioner  DILU;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        //tolerance       (1e-10 1e-8 1);
        relTol          1e-2;
        //relTol          (0.01 0.01 1);
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    "(c|psi|chi|xi)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        smoother        DILU;
        tolerance       1e-10;
        relTol          1e-2;
        maxIter         20;
    }

    "(c|psi|chi|xi)Final"
    {
        $c;
        relTol          0;
    }

}

"PIMPLE|PISO|SIMPLE"
{
    consistent yes;
    momentumPredictor   on;
    nOuterCorrectors    5;//100;  // PIMPLE loops
    nCorrectors         10;   // pressure loop
    nNonOrthogonalCorrectors 1;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    residualControl
    {
        ".*"           1e-15;
    }
    outerCorrectorResidualControl //residualControl
    {
        ".*"
        {
            tolerance 1e-6;
            relTol    1e-3;
        }
        U
        {
            tolerance 1e-3;
            relTol 1e-1;
        }
    }
}

relaxationFactors
{
    equations
    {
        U 0.95;
        p 1;
    }
    fields
    {
        U 1;
        p 1;
    }
}


// ************************************************************************* //
